const agreements = `
尊敬的用户：

欢迎使用易如黄历微信小程序（以下简称“本程序”），本程序集成了先进的人工智能技术，包括但不限于通义千问大模型，旨在为用户提供关于紫微斗数、梅花易数等传统文化知识的互动体验与信息参考。在此特别强调，所有预测内容仅供娱乐与文化交流目的，并不代表实际生活中的确切结果或专业建议。

非专业预测工具：本程序提供的预测服务基于算法处理与数据分析，不涉及任何超自然力量，也不等同于专业命理咨询。其结果不具备法律效力，不应作为个人决策的唯一依据。

理性看待：我们鼓励用户以理性、科学的态度看待所有预测内容，保持批判性思维，不迷信、不过度依赖预测结果，对于重要人生决策应结合实际情况综合考量。

法律责任：本程序开发者及运营团队不对因使用本程序内预测功能所导致的任何直接或间接损失承担法律责任。用户在使用过程中的一切行为及后果自负。

文化尊重：虽然本程序尝试融合传统文化元素，但坚决反对任何形式的封建迷信活动。我们倡导尊重并传承中华优秀传统文化的正面价值观，反对利用传统文化进行不良诱导。

隐私保护：我们承诺对用户提供的个人信息严格保密，并按照相关法律法规要求处理数据，保障用户隐私安全。

请用户在充分理解上述声明的基础上使用本程序。继续使用即视为同意本免责声明。如有任何疑问或建议，欢迎联系我们（yaoyigua2028@163.com）。
`;

module.exports = {
  getAgreements: () => agreements
}