let yaos = [{
    "rank": 1,
    "yao": "阳",
    "yaoi": "上九",
    "text": "亢龙有悔。"
  },
  {
    "rank": 2,
    "yao": "阳",
    "yaoi": "九五",
    "text": "飞龙在天，利见大人。"
  },
  {
    "rank": 3,
    "yao": "阳",
    "yaoi": "九四",
    "text": "或跃在渊，无咎。"
  },
  {
    "rank": 4,
    "yao": "阳",
    "yaoi": "九三",
    "text": "君子终日乾乾，夕惕若厉，无咎。"
  },
  {
    "rank": 5,
    "yao": "阳",
    "yaoi": "九二",
    "text": "见龙在田，利见大人"
  },
  {
    "rank": 6,
    "yao": "阳",
    "yaoi": "初九",
    "text": "潜龙勿用"
  },
  {
    "rank": 7,
    "yao": "阴",
    "yaoi": "上六",
    "text": "龙战于野，其血玄黄。"
  },
  {
    "rank": 8,
    "yao": "阴",
    "yaoi": "六五",
    "text": "黄裳元吉。"
  },
  {
    "rank": 9,
    "yao": "阴",
    "yaoi": "六四",
    "text": "括囊，无咎，无誉。"
  },
  {
    "rank": 10,
    "yao": "阴",
    "yaoi": "六三",
    "text": "含章可贞。或从王事，无成有终。"
  },
  {
    "rank": 11,
    "yao": "阴",
    "yaoi": "六二",
    "text": "直方大，不习无不利。"
  },
  {
    "rank": 12,
    "yao": "阴",
    "yaoi": "初六",
    "text": "履霜坚冰至。"
  },
  {
    "rank": 13,
    "yao": "阴",
    "yaoi": "上六",
    "text": "乘马班如。泣血涟如。"
  },
  {
    "rank": 14,
    "yao": "阳",
    "yaoi": "九五",
    "text": "屯其膏，小贞吉，大贞凶。"
  },
  {
    "rank": 15,
    "yao": "阴",
    "yaoi": "六四",
    "text": "乘马班如。求婚媾。往吉。无不利。"
  },
  {
    "rank": 16,
    "yao": "阴",
    "yaoi": "六三",
    "text": "即鹿无虞，惟入于林中，君子几不如舍，往吝。"
  },
  {
    "rank": 17,
    "yao": "阴",
    "yaoi": "六二",
    "text": "屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。"
  },
  {
    "rank": 18,
    "yao": "阳",
    "yaoi": "初九",
    "text": "磐桓，利居贞，利建侯。"
  },
  {
    "rank": 19,
    "yao": "阳",
    "yaoi": "上九",
    "text": "击蒙，不利为寇，利御寇。"
  },
  {
    "rank": 20,
    "yao": "阴",
    "yaoi": "六五",
    "text": "童蒙，吉。"
  },
  {
    "rank": 21,
    "yao": "阴",
    "yaoi": "六四",
    "text": "困蒙，吝。"
  },
  {
    "rank": 22,
    "yao": "阴",
    "yaoi": "六三",
    "text": "勿用娶女，见金夫，不有躬，无攸利。"
  },
  {
    "rank": 23,
    "yao": "阳",
    "yaoi": "九二",
    "text": "包蒙吉，纳妇吉，子克家。"
  },
  {
    "rank": 24,
    "yao": "阴",
    "yaoi": "初六",
    "text": "发蒙，利用刑人，用说桎梏，以往吝。"
  },
  {
    "rank": 25,
    "yao": "阴",
    "yaoi": "上六",
    "text": "入于穴，有不速之客三人来，敬之，终吉。"
  },
  {
    "rank": 26,
    "yao": "阳",
    "yaoi": "九五",
    "text": "需于酒食，贞吉。"
  },
  {
    "rank": 27,
    "yao": "阴",
    "yaoi": "六四",
    "text": "需于血，出自穴。"
  },
  {
    "rank": 28,
    "yao": "阳",
    "yaoi": "九三",
    "text": "需于泥，致寇至。"
  },
  {
    "rank": 29,
    "yao": "阳",
    "yaoi": "九二",
    "text": "需于沙。小有言，终吉。"
  },
  {
    "rank": 30,
    "yao": "阳",
    "yaoi": "初九",
    "text": "需于郊。利用恒，无咎。"
  },
  {
    "rank": 31,
    "yao": "阳",
    "yaoi": "上九",
    "text": "或锡之鞶带，终朝三褫之。"
  },
  {
    "rank": 32,
    "yao": "阳",
    "yaoi": "九五",
    "text": "讼元吉。"
  },
  {
    "rank": 33,
    "yao": "阳",
    "yaoi": "九四",
    "text": "不克讼，複即命，渝安贞，吉。"
  },
  {
    "rank": 34,
    "yao": "阴",
    "yaoi": "六三",
    "text": "食旧德，贞，厉终吉，或从王事，无成。"
  },
  {
    "rank": 35,
    "yao": "阳",
    "yaoi": "九二",
    "text": "不克讼，归而逋，其邑人三百户，无眚。"
  },
  {
    "rank": 36,
    "yao": "阴",
    "yaoi": "初六",
    "text": "不永所事，小有言，终吉。"
  },
  {
    "rank": 37,
    "yao": "阴",
    "yaoi": "上六",
    "text": "大君有命，开国承家，小人勿用。"
  },
  {
    "rank": 38,
    "yao": "阴",
    "yaoi": "六五",
    "text": "田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。"
  },
  {
    "rank": 39,
    "yao": "阴",
    "yaoi": "六四",
    "text": "师左次，无咎。"
  },
  {
    "rank": 40,
    "yao": "阴",
    "yaoi": "六三",
    "text": "师或舆尸，凶。"
  },
  {
    "rank": 41,
    "yao": "阳",
    "yaoi": "九二",
    "text": "在师中吉，无咎，王三锡命。"
  },
  {
    "rank": 42,
    "yao": "阴",
    "yaoi": "初六",
    "text": "师出以律，否臧凶。"
  },
  {
    "rank": 43,
    "yao": "阴",
    "yaoi": "上六",
    "text": "比之无首，凶。"
  },
  {
    "rank": 44,
    "yao": "阳",
    "yaoi": "九五",
    "text": "显比，王用三驱，失前禽。邑人不诫，吉。"
  },
  {
    "rank": 45,
    "yao": "阴",
    "yaoi": "六四",
    "text": "外比之，贞吉。"
  },
  {
    "rank": 46,
    "yao": "阴",
    "yaoi": "六三",
    "text": "比之匪人。"
  },
  {
    "rank": 47,
    "yao": "阴",
    "yaoi": "六二",
    "text": "比之自内，贞吉。"
  },
  {
    "rank": 48,
    "yao": "阴",
    "yaoi": "初六",
    "text": "有孚比之，无咎。有孚盈缶，终来有它吉。"
  },
  {
    "rank": 49,
    "yao": "阳",
    "yaoi": "上九",
    "text": "既雨既处，尚德载，妇贞厉。月几望，君子征凶。"
  },
  {
    "rank": 50,
    "yao": "阳",
    "yaoi": "九五",
    "text": "有孚挛如，富以其邻。"
  },
  {
    "rank": 51,
    "yao": "阴",
    "yaoi": "六四",
    "text": "有孚，血去惕出，无咎。"
  },
  {
    "rank": 52,
    "yao": "阳",
    "yaoi": "九三",
    "text": "舆说辐，夫妻反目。"
  },
  {
    "rank": 53,
    "yao": "阳",
    "yaoi": "九二",
    "text": "牵複，吉。"
  },
  {
    "rank": 54,
    "yao": "阳",
    "yaoi": "初九",
    "text": "複自道，何其咎，吉。"
  },
  {
    "rank": 55,
    "yao": "阳",
    "yaoi": "上九",
    "text": "视履考祥，其旋元吉。"
  },
  {
    "rank": 56,
    "yao": "阳",
    "yaoi": "九五",
    "text": "夬履，贞厉。"
  },
  {
    "rank": 57,
    "yao": "阳",
    "yaoi": "九四",
    "text": "履虎尾，愬愬终吉。"
  },
  {
    "rank": 58,
    "yao": "阴",
    "yaoi": "六三",
    "text": "眇能视，跛能履，履虎尾咥人，凶。武人为于大君。"
  },
  {
    "rank": 59,
    "yao": "阳",
    "yaoi": "九二",
    "text": "履道坦坦，幽人贞吉。"
  },
  {
    "rank": 60,
    "yao": "阳",
    "yaoi": "初九",
    "text": "素履往，无咎。"
  },
  {
    "rank": 61,
    "yao": "阴",
    "yaoi": "上六",
    "text": "城複于隍，勿用师。自邑告命，贞吝。"
  },
  {
    "rank": 62,
    "yao": "阴",
    "yaoi": "六五",
    "text": "帝乙归妹，以祉元吉。"
  },
  {
    "rank": 63,
    "yao": "阴",
    "yaoi": "六四",
    "text": "翩翩，不富以其邻，不戒以孚。"
  },
  {
    "rank": 64,
    "yao": "阳",
    "yaoi": "九三",
    "text": "无平不陂，无往不复，艰贞无咎。勿恤其孚，于食有福。"
  },
  {
    "rank": 65,
    "yao": "阳",
    "yaoi": "九二",
    "text": "包荒，用冯河，不遐遗，朋亡，得尚于中行。"
  },
  {
    "rank": 66,
    "yao": "阳",
    "yaoi": "初九",
    "text": "拔茅茹，以其夤，徵吉。"
  },
  {
    "rank": 67,
    "yao": "阳",
    "yaoi": "上九",
    "text": "倾否，先否后喜。"
  },
  {
    "rank": 68,
    "yao": "阳",
    "yaoi": "九五",
    "text": "休否，大人吉。其亡其亡，系于苞桑。"
  },
  {
    "rank": 69,
    "yao": "阳",
    "yaoi": "九四",
    "text": "有命无咎，畴离祉。"
  },
  {
    "rank": 70,
    "yao": "阴",
    "yaoi": "六三",
    "text": "包羞"
  },
  {
    "rank": 71,
    "yao": "阴",
    "yaoi": "六二",
    "text": "包承。小人吉，大人否亨。"
  },
  {
    "rank": 72,
    "yao": "阴",
    "yaoi": "初六",
    "text": "拔茅茹，以其夤，贞吉亨。"
  },
  {
    "rank": 73,
    "yao": "阳",
    "yaoi": "上九",
    "text": "同人于郊，无悔。"
  },
  {
    "rank": 74,
    "yao": "阳",
    "yaoi": "九五",
    "text": "同人，先号咷而后笑。大师克相遇。"
  },
  {
    "rank": 75,
    "yao": "阳",
    "yaoi": "九四",
    "text": "乘其墉，弗克攻，吉。"
  },
  {
    "rank": 76,
    "yao": "阳",
    "yaoi": "九三",
    "text": "伏戎于莽，升其高陵，三岁不兴。"
  },
  {
    "rank": 77,
    "yao": "阴",
    "yaoi": "六二",
    "text": "同人于宗，吝。"
  },
  {
    "rank": 78,
    "yao": "阳",
    "yaoi": "初九",
    "text": "同人于门，无咎。"
  },
  {
    "rank": 79,
    "yao": "阳",
    "yaoi": "上九",
    "text": "自天佑之，吉无不利。"
  },
  {
    "rank": 80,
    "yao": "阴",
    "yaoi": "六五",
    "text": "厥孚交如，威如，吉。"
  },
  {
    "rank": 81,
    "yao": "阳",
    "yaoi": "九四",
    "text": "匪其彭，无咎。"
  },
  {
    "rank": 82,
    "yao": "阳",
    "yaoi": "九三",
    "text": "公用亨于天子，小人弗克。"
  },
  {
    "rank": 83,
    "yao": "阳",
    "yaoi": "九二",
    "text": "大车以载，有攸往，无咎。"
  },
  {
    "rank": 84,
    "yao": "阳",
    "yaoi": "初九",
    "text": "无交害，匪咎，艰则无咎。"
  },
  {
    "rank": 85,
    "yao": "阴",
    "yaoi": "上六",
    "text": "鸣谦，利用行师，征邑国。"
  },
  {
    "rank": 86,
    "yao": "阴",
    "yaoi": "六五",
    "text": "不富以其邻，利用侵伐，无不利。"
  },
  {
    "rank": 87,
    "yao": "阴",
    "yaoi": "六四",
    "text": "无不利，撝谦。"
  },
  {
    "rank": 88,
    "yao": "阳",
    "yaoi": "九三",
    "text": "劳谦君子，有终吉。"
  },
  {
    "rank": 89,
    "yao": "阴",
    "yaoi": "六二",
    "text": "鸣谦，贞吉。"
  },
  {
    "rank": 90,
    "yao": "阴",
    "yaoi": "初六",
    "text": "谦谦君子，用涉大川，吉。"
  },
  {
    "rank": 91,
    "yao": "阴",
    "yaoi": "上六",
    "text": "冥豫，成有渝，无咎。"
  },
  {
    "rank": 92,
    "yao": "阴",
    "yaoi": "六五",
    "text": "贞疾，恒不死。"
  },
  {
    "rank": 93,
    "yao": "阳",
    "yaoi": "九四",
    "text": "由豫，大有得。勿疑。朋盍簪。"
  },
  {
    "rank": 94,
    "yao": "阴",
    "yaoi": "六三",
    "text": "盱豫，悔。迟有悔。"
  },
  {
    "rank": 95,
    "yao": "阴",
    "yaoi": "六二",
    "text": "介于石，不终日，贞吉。"
  },
  {
    "rank": 96,
    "yao": "阴",
    "yaoi": "初六",
    "text": "鸣豫，凶。"
  },
  {
    "rank": 97,
    "yao": "阴",
    "yaoi": "上六",
    "text": "拘係之，乃从维之。王用亨于西山。"
  },
  {
    "rank": 98,
    "yao": "阳",
    "yaoi": "九五",
    "text": "孚于嘉，吉。"
  },
  {
    "rank": 99,
    "yao": "阳",
    "yaoi": "九四",
    "text": "随有获，贞凶。有孚在道以明，何咎。"
  },
  {
    "rank": 100,
    "yao": "阴",
    "yaoi": "六三",
    "text": "係丈夫，失小子。随有求得，利居贞。"
  },
  {
    "rank": 101,
    "yao": "阴",
    "yaoi": "六二",
    "text": "係小子，失丈夫。"
  },
  {
    "rank": 102,
    "yao": "阳",
    "yaoi": "初九",
    "text": "官有渝，贞吉。出门交有功。"
  },
  {
    "rank": 103,
    "yao": "阳",
    "yaoi": "上九",
    "text": "不事王侯，高尚其事。"
  },
  {
    "rank": 104,
    "yao": "阴",
    "yaoi": "六五",
    "text": "干父之蛊，用誉。"
  },
  {
    "rank": 105,
    "yao": "阴",
    "yaoi": "六四",
    "text": "裕父之蛊，往见吝。"
  },
  {
    "rank": 106,
    "yao": "阳",
    "yaoi": "九三",
    "text": "干父之蛊，小有晦，无大咎。"
  },
  {
    "rank": 107,
    "yao": "阳",
    "yaoi": "九二",
    "text": "干母之蛊，不可贞。"
  },
  {
    "rank": 108,
    "yao": "阴",
    "yaoi": "初六",
    "text": "干父之蛊，有子，考无咎，厉终吉。"
  },
  {
    "rank": 109,
    "yao": "阴",
    "yaoi": "上六",
    "text": "敦临，吉，无咎。"
  },
  {
    "rank": 110,
    "yao": "阴",
    "yaoi": "六五",
    "text": "知临，大君之宜，吉。"
  },
  {
    "rank": 111,
    "yao": "阴",
    "yaoi": "六四",
    "text": "至临，无咎。"
  },
  {
    "rank": 112,
    "yao": "阴",
    "yaoi": "六三",
    "text": "甘临，无攸利。既忧之，无咎。"
  },
  {
    "rank": 113,
    "yao": "阳",
    "yaoi": "九二",
    "text": "咸临吉，无不利。"
  },
  {
    "rank": 114,
    "yao": "阳",
    "yaoi": "初九",
    "text": "咸临贞吉。"
  },
  {
    "rank": 115,
    "yao": "阳",
    "yaoi": "上九",
    "text": "观其生，君子无咎。"
  },
  {
    "rank": 116,
    "yao": "阳",
    "yaoi": "九五",
    "text": "观我生，君子无咎。"
  },
  {
    "rank": 117,
    "yao": "阴",
    "yaoi": "六四",
    "text": "观国之光，利用宾于王。"
  },
  {
    "rank": 118,
    "yao": "阴",
    "yaoi": "六三",
    "text": "观我生进退。"
  },
  {
    "rank": 119,
    "yao": "阴",
    "yaoi": "六二",
    "text": "窥观，利女贞。"
  },
  {
    "rank": 120,
    "yao": "阴",
    "yaoi": "初六",
    "text": "童观，小人无咎，君子吝。"
  },
  {
    "rank": 121,
    "yao": "阳",
    "yaoi": "上九",
    "text": "何校灭耳，凶。"
  },
  {
    "rank": 122,
    "yao": "阴",
    "yaoi": "六五",
    "text": "噬乾肉，得黄金，贞厉，无咎。"
  },
  {
    "rank": 123,
    "yao": "阳",
    "yaoi": "九四",
    "text": "噬乾胏，得金矢，利艰贞，吉。"
  },
  {
    "rank": 124,
    "yao": "阴",
    "yaoi": "六三",
    "text": "噬腊肉，遇毒，小吝，无咎。"
  },
  {
    "rank": 125,
    "yao": "阴",
    "yaoi": "六二",
    "text": "噬肤灭鼻，无咎。"
  },
  {
    "rank": 126,
    "yao": "阳",
    "yaoi": "初九",
    "text": "屦校灭趾，无咎。"
  },
  {
    "rank": 127,
    "yao": "阳",
    "yaoi": "上九",
    "text": "白贲，无咎。"
  },
  {
    "rank": 128,
    "yao": "阴",
    "yaoi": "六五",
    "text": "贲于丘园，束帛戋戋，吝，终吉。"
  },
  {
    "rank": 129,
    "yao": "阴",
    "yaoi": "六四",
    "text": "贲如皤如，白马翰如，匪寇婚媾。"
  },
  {
    "rank": 130,
    "yao": "阳",
    "yaoi": "九三",
    "text": "贲如濡如，永贞吉。"
  },
  {
    "rank": 131,
    "yao": "阴",
    "yaoi": "六二",
    "text": "贲其须。"
  },
  {
    "rank": 132,
    "yao": "阳",
    "yaoi": "初九",
    "text": "贲其趾，捨车而徒。"
  },
  {
    "rank": 133,
    "yao": "阳",
    "yaoi": "上九",
    "text": "硕果不食，君子得舆，小人剥庐。"
  },
  {
    "rank": 134,
    "yao": "阴",
    "yaoi": "六五",
    "text": "贯鱼，以宫人宠，无不利。"
  },
  {
    "rank": 135,
    "yao": "阴",
    "yaoi": "六四",
    "text": "剥床以肤，凶。"
  },
  {
    "rank": 136,
    "yao": "阴",
    "yaoi": "六三",
    "text": "剥之，无咎。"
  },
  {
    "rank": 137,
    "yao": "阴",
    "yaoi": "六二",
    "text": "剥床以辨，蔑贞凶。"
  },
  {
    "rank": 138,
    "yao": "阴",
    "yaoi": "初六",
    "text": "剥床以足，蔑贞凶。"
  },
  {
    "rank": 139,
    "yao": "阴",
    "yaoi": "上六",
    "text": "迷复，凶，有灾眚。用行师，终有大败， 以其国君凶。至于十年不克征。"
  },
  {
    "rank": 140,
    "yao": "阴",
    "yaoi": "六五",
    "text": "敦复，无悔。"
  },
  {
    "rank": 141,
    "yao": "阴",
    "yaoi": "六四",
    "text": "中行独复。"
  },
  {
    "rank": 142,
    "yao": "阴",
    "yaoi": "六三",
    "text": "频复，厉无咎。"
  },
  {
    "rank": 143,
    "yao": "阴",
    "yaoi": "六二",
    "text": "休复，吉。"
  },
  {
    "rank": 144,
    "yao": "阳",
    "yaoi": "初九",
    "text": "不远复，无只悔，元吉。"
  },
  {
    "rank": 145,
    "yao": "阳",
    "yaoi": "上九",
    "text": "无妄，行有眚，无攸利。"
  },
  {
    "rank": 146,
    "yao": "阳",
    "yaoi": "九五",
    "text": "无妄之疾，勿药有喜。"
  },
  {
    "rank": 147,
    "yao": "阳",
    "yaoi": "九四",
    "text": "可贞，无咎。"
  },
  {
    "rank": 148,
    "yao": "阴",
    "yaoi": "六三",
    "text": "无妄之灾，或系之牛，行人之得，邑人之灾。"
  },
  {
    "rank": 149,
    "yao": "阴",
    "yaoi": "六二",
    "text": "不耕获，不菑畲，则利有攸往。"
  },
  {
    "rank": 150,
    "yao": "阳",
    "yaoi": "初九",
    "text": "无妄，往吉。"
  },
  {
    "rank": 151,
    "yao": "阳",
    "yaoi": "上九",
    "text": "何天之衢，亨。"
  },
  {
    "rank": 152,
    "yao": "阴",
    "yaoi": "六五",
    "text": "豶豕之牙，吉。"
  },
  {
    "rank": 153,
    "yao": "阴",
    "yaoi": "六四",
    "text": "童豕之牿，元吉。"
  },
  {
    "rank": 154,
    "yao": "阳",
    "yaoi": "九三",
    "text": "良马逐，利艰贞。日闲舆卫，利有攸往。"
  },
  {
    "rank": 155,
    "yao": "阳",
    "yaoi": "九二",
    "text": "舆说辐。"
  },
  {
    "rank": 156,
    "yao": "阳",
    "yaoi": "初九",
    "text": "有厉，利已。"
  },
  {
    "rank": 157,
    "yao": "阳",
    "yaoi": "上九",
    "text": "由颐，厉吉，利涉大川。"
  },
  {
    "rank": 158,
    "yao": "阴",
    "yaoi": "六五",
    "text": "拂经，居贞吉，不可涉大川。"
  },
  {
    "rank": 159,
    "yao": "阴",
    "yaoi": "六四",
    "text": "颠颐吉，虎视眈眈，其欲逐逐，无咎。"
  },
  {
    "rank": 160,
    "yao": "阴",
    "yaoi": "六三",
    "text": "拂颐。贞凶。十年勿用。无攸利。"
  },
  {
    "rank": 161,
    "yao": "阴",
    "yaoi": "六二",
    "text": "颠颐，拂经于丘，颐征凶。"
  },
  {
    "rank": 162,
    "yao": "阳",
    "yaoi": "初九",
    "text": "舍尔灵龟，观我朵颐，凶。"
  },
  {
    "rank": 163,
    "yao": "阴",
    "yaoi": "上六",
    "text": "过涉灭顶，凶，无咎。"
  },
  {
    "rank": 164,
    "yao": "阳",
    "yaoi": "九五",
    "text": "枯杨生华，老妇得士夫，无咎无誉。"
  },
  {
    "rank": 165,
    "yao": "阳",
    "yaoi": "九四",
    "text": "栋隆，吉，有它吝。"
  },
  {
    "rank": 166,
    "yao": "阳",
    "yaoi": "九三",
    "text": "栋桡，凶。"
  },
  {
    "rank": 167,
    "yao": "阳",
    "yaoi": "九二",
    "text": "枯杨生稊，老夫得其女妻，无不利。"
  },
  {
    "rank": 168,
    "yao": "阴",
    "yaoi": "初六",
    "text": "藉用白茅，无咎。"
  },
  {
    "rank": 169,
    "yao": "阴",
    "yaoi": "上六",
    "text": "系用徽纆，置于丛棘，三岁不得，凶。"
  },
  {
    "rank": 170,
    "yao": "阳",
    "yaoi": "九五",
    "text": "坎不盈，只既平，无咎。"
  },
  {
    "rank": 171,
    "yao": "阴",
    "yaoi": "六四",
    "text": "樽酒簋贰，用缶，纳约自牖，终无咎。"
  },
  {
    "rank": 172,
    "yao": "阴",
    "yaoi": "六三",
    "text": "来之坎坎，险且枕，入于坎窞，勿用。"
  },
  {
    "rank": 173,
    "yao": "阳",
    "yaoi": "九二",
    "text": "坎有险，求小得。"
  },
  {
    "rank": 174,
    "yao": "阴",
    "yaoi": "初六",
    "text": "习坎，入于坎窞，凶。"
  },
  {
    "rank": 175,
    "yao": "阳",
    "yaoi": "上九",
    "text": "王用出征，有嘉。折首。获其匪丑，无咎。"
  },
  {
    "rank": 176,
    "yao": "阴",
    "yaoi": "六五",
    "text": "出涕沱若，戚嗟若，吉。"
  },
  {
    "rank": 177,
    "yao": "阳",
    "yaoi": "九四",
    "text": "突如其来如，焚如，死如，弃如。"
  },
  {
    "rank": 178,
    "yao": "阳",
    "yaoi": "九三",
    "text": "日昃之离，不鼓缶而歌，则大耋之嗟，凶。"
  },
  {
    "rank": 179,
    "yao": "阴",
    "yaoi": "六二",
    "text": "黄离，元吉。"
  },
  {
    "rank": 180,
    "yao": "阳",
    "yaoi": "初九",
    "text": "履错然，敬之无咎。"
  },
  {
    "rank": 181,
    "yao": "阴",
    "yaoi": "上六",
    "text": "咸其辅，颊，舌。"
  },
  {
    "rank": 182,
    "yao": "阳",
    "yaoi": "九五",
    "text": "咸其脢，无悔。"
  },
  {
    "rank": 183,
    "yao": "阳",
    "yaoi": "九四",
    "text": "贞吉悔亡，憧憧往来，朋从尔思。"
  },
  {
    "rank": 184,
    "yao": "阳",
    "yaoi": "九三",
    "text": "咸其股，执其随，往吝。"
  },
  {
    "rank": 185,
    "yao": "阴",
    "yaoi": "六二",
    "text": "咸其腓，凶，居吉。"
  },
  {
    "rank": 186,
    "yao": "阴",
    "yaoi": "初六",
    "text": "咸其拇。"
  },
  {
    "rank": 187,
    "yao": "阴",
    "yaoi": "上六",
    "text": "振恒，凶。"
  },
  {
    "rank": 188,
    "yao": "阴",
    "yaoi": "六五",
    "text": "恒其德贞，妇人吉，夫子凶。"
  },
  {
    "rank": 189,
    "yao": "阳",
    "yaoi": "九四",
    "text": "田无禽。"
  },
  {
    "rank": 190,
    "yao": "阳",
    "yaoi": "九三",
    "text": "不恒其德，或承之羞，贞吝。"
  },
  {
    "rank": 191,
    "yao": "阳",
    "yaoi": "九二",
    "text": "悔亡。"
  },
  {
    "rank": 192,
    "yao": "阴",
    "yaoi": "初六",
    "text": "浚恒贞凶，无攸利。"
  },
  {
    "rank": 193,
    "yao": "阳",
    "yaoi": "上九",
    "text": "肥遯，无不利。"
  },
  {
    "rank": 194,
    "yao": "阳",
    "yaoi": "九五",
    "text": "嘉遯贞吉。"
  },
  {
    "rank": 195,
    "yao": "阳",
    "yaoi": "九四",
    "text": "好遯，君子吉，小人否。"
  },
  {
    "rank": 196,
    "yao": "阳",
    "yaoi": "九三",
    "text": "系遯有疾厉，畜臣妾吉。"
  },
  {
    "rank": 197,
    "yao": "阴",
    "yaoi": "六二",
    "text": "执之用黄牛之革，莫之胜说。"
  },
  {
    "rank": 198,
    "yao": "阴",
    "yaoi": "初六",
    "text": "遯尾厉，勿用有攸往。"
  },
  {
    "rank": 199,
    "yao": "阴",
    "yaoi": "上六",
    "text": "羝羊触藩，不能退，不能遂，无攸利，艰则吉。"
  },
  {
    "rank": 200,
    "yao": "阴",
    "yaoi": "六五",
    "text": "丧羊于易，无悔。"
  },
  {
    "rank": 201,
    "yao": "阳",
    "yaoi": "九四",
    "text": "贞吉，悔亡，藩决不羸，壮于大舆之輹。"
  },
  {
    "rank": 202,
    "yao": "阳",
    "yaoi": "九三",
    "text": "小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。"
  },
  {
    "rank": 203,
    "yao": "阳",
    "yaoi": "九二",
    "text": "贞吉。"
  },
  {
    "rank": 204,
    "yao": "阳",
    "yaoi": "初九",
    "text": "壮于趾，征凶，有孚。"
  },
  {
    "rank": 205,
    "yao": "阳",
    "yaoi": "上九",
    "text": "晋其角，维用伐邑，厉吉无咎，贞吝。"
  },
  {
    "rank": 206,
    "yao": "阴",
    "yaoi": "六五",
    "text": "悔亡，失得勿恤，往吉无不利。"
  },
  {
    "rank": 207,
    "yao": "阳",
    "yaoi": "九四",
    "text": "晋如鼫鼠，贞厉。"
  },
  {
    "rank": 208,
    "yao": "阴",
    "yaoi": "六三",
    "text": "众允，悔亡。"
  },
  {
    "rank": 209,
    "yao": "阴",
    "yaoi": "六二",
    "text": "晋如，愁如，贞吉。受兹介福，于其王母。"
  },
  {
    "rank": 210,
    "yao": "阴",
    "yaoi": "初六",
    "text": "晋如，摧如，贞吉。罔孚，裕无咎。"
  },
  {
    "rank": 211,
    "yao": "阴",
    "yaoi": "上六",
    "text": "不明晦，初登于天，后入于地。"
  },
  {
    "rank": 212,
    "yao": "阴",
    "yaoi": "六五",
    "text": "箕子之明夷，利贞。"
  },
  {
    "rank": 213,
    "yao": "阴",
    "yaoi": "六四",
    "text": "入于左腹，获明夷之心，出于门庭。"
  },
  {
    "rank": 214,
    "yao": "阳",
    "yaoi": "九三",
    "text": "明夷于南狩，得其大首，不可疾贞。"
  },
  {
    "rank": 215,
    "yao": "阴",
    "yaoi": "六二",
    "text": "明夷，夷于左股，用拯马壮，吉。"
  },
  {
    "rank": 216,
    "yao": "阳",
    "yaoi": "初九",
    "text": "明夷于飞，垂其翼。君子于行，三日不食，有攸往，主人有言。"
  },
  {
    "rank": 217,
    "yao": "阳",
    "yaoi": "上九",
    "text": "有孚威如，终吉。"
  },
  {
    "rank": 218,
    "yao": "阳",
    "yaoi": "九五",
    "text": "王假有家，勿恤吉。"
  },
  {
    "rank": 219,
    "yao": "阴",
    "yaoi": "六四",
    "text": "富家，大吉。"
  },
  {
    "rank": 220,
    "yao": "阳",
    "yaoi": "九三",
    "text": "家人嗃嗃，悔厉吉，妇子嘻嘻，终吝。"
  },
  {
    "rank": 221,
    "yao": "阴",
    "yaoi": "六二",
    "text": "无攸遂，在中馈，贞吉。"
  },
  {
    "rank": 222,
    "yao": "阳",
    "yaoi": "初九",
    "text": "闲有家，悔亡。"
  },
  {
    "rank": 223,
    "yao": "阳",
    "yaoi": "上九",
    "text": "睽孤，见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。"
  },
  {
    "rank": 224,
    "yao": "阴",
    "yaoi": "六五",
    "text": "悔亡，厥宗噬肤，往何咎。"
  },
  {
    "rank": 225,
    "yao": "阳",
    "yaoi": "九四",
    "text": "睽孤，遇元夫，交孚，厉无咎。"
  },
  {
    "rank": 226,
    "yao": "阴",
    "yaoi": "六三",
    "text": "见舆曳，其牛掣，其人天且劓，无初有终。"
  },
  {
    "rank": 227,
    "yao": "阳",
    "yaoi": "九二",
    "text": "遇主于巷，无咎。"
  },
  {
    "rank": 228,
    "yao": "阳",
    "yaoi": "初九",
    "text": "悔亡，丧马勿逐，自複，见恶人无咎。"
  },
  {
    "rank": 229,
    "yao": "阴",
    "yaoi": "上六",
    "text": "往蹇来硕，吉，利见大人。"
  },
  {
    "rank": 230,
    "yao": "阳",
    "yaoi": "九五",
    "text": "大蹇朋来。"
  },
  {
    "rank": 231,
    "yao": "阴",
    "yaoi": "六四",
    "text": "往蹇来连。"
  },
  {
    "rank": 232,
    "yao": "阳",
    "yaoi": "九三",
    "text": "往蹇来反。"
  },
  {
    "rank": 233,
    "yao": "阴",
    "yaoi": "六二",
    "text": "王臣蹇蹇，匪躬之故。"
  },
  {
    "rank": 234,
    "yao": "阴",
    "yaoi": "初六",
    "text": "往蹇，来誉。"
  },
  {
    "rank": 235,
    "yao": "阴",
    "yaoi": "上六",
    "text": "公用射隼于高墉之上，获之，无不利。"
  },
  {
    "rank": 236,
    "yao": "阴",
    "yaoi": "六五",
    "text": "君子维有解，吉，有孚于小人。"
  },
  {
    "rank": 237,
    "yao": "阳",
    "yaoi": "九四",
    "text": "解而拇，朋至斯孚。"
  },
  {
    "rank": 238,
    "yao": "阴",
    "yaoi": "六三",
    "text": "负且乘，致寇至，贞吝。"
  },
  {
    "rank": 239,
    "yao": "阳",
    "yaoi": "九二",
    "text": "田获三狐，得黄矢，贞吉。"
  },
  {
    "rank": 240,
    "yao": "阴",
    "yaoi": "初六",
    "text": "无咎。"
  },
  {
    "rank": 241,
    "yao": "阳",
    "yaoi": "上九",
    "text": "弗损益之，无咎，贞吉，利有攸往，得臣无家。"
  },
  {
    "rank": 242,
    "yao": "阴",
    "yaoi": "六五",
    "text": "或益之十朋之龟，弗克违，元吉。"
  },
  {
    "rank": 243,
    "yao": "阴",
    "yaoi": "六四",
    "text": "损其疾，使遄有喜，无咎。"
  },
  {
    "rank": 244,
    "yao": "阴",
    "yaoi": "六三",
    "text": "三人行，则损一人，一人行，则得其友。"
  },
  {
    "rank": 245,
    "yao": "阳",
    "yaoi": "九二",
    "text": "利贞，征凶，弗损益之。"
  },
  {
    "rank": 246,
    "yao": "阳",
    "yaoi": "初九",
    "text": "已事遄往，无咎，酌损之。"
  },
  {
    "rank": 247,
    "yao": "阳",
    "yaoi": "上九",
    "text": "莫益之，或击之，立心勿恒，凶。"
  },
  {
    "rank": 248,
    "yao": "阳",
    "yaoi": "九五",
    "text": "有孚惠心，勿问元吉。有孚惠我德。"
  },
  {
    "rank": 249,
    "yao": "阴",
    "yaoi": "六四",
    "text": "中行，告公从。利用为依迁国。"
  },
  {
    "rank": 250,
    "yao": "阴",
    "yaoi": "六三",
    "text": "益之用凶事，无咎。有孚中行，告公用圭。"
  },
  {
    "rank": 251,
    "yao": "阴",
    "yaoi": "六二",
    "text": "或益之，十朋之龟，弗克违，永贞吉。王用享于帝，吉。"
  },
  {
    "rank": 252,
    "yao": "阳",
    "yaoi": "初九",
    "text": "利用为大作，元吉无咎。"
  },
  {
    "rank": 253,
    "yao": "阴",
    "yaoi": "上六",
    "text": "无号，终有凶。"
  },
  {
    "rank": 254,
    "yao": "阳",
    "yaoi": "九五",
    "text": "苋陆夬夬，中行无咎。"
  },
  {
    "rank": 255,
    "yao": "阳",
    "yaoi": "九四",
    "text": "臀无肤，其行次且。牵羊悔亡，闻言不信。"
  },
  {
    "rank": 256,
    "yao": "阳",
    "yaoi": "九三",
    "text": "壮于頄，有凶。君子夬夬，独行遇雨，若濡有愠，无咎。"
  },
  {
    "rank": 257,
    "yao": "阳",
    "yaoi": "九二",
    "text": "惕号，莫夜有戎，勿恤。"
  },
  {
    "rank": 258,
    "yao": "阳",
    "yaoi": "初九",
    "text": "壮于前趾，往不胜为吝。"
  },
  {
    "rank": 259,
    "yao": "阳",
    "yaoi": "上九",
    "text": "姤其角，吝，无咎。"
  },
  {
    "rank": 260,
    "yao": "阳",
    "yaoi": "九五",
    "text": "以杞包瓜，含章，有陨自天。"
  },
  {
    "rank": 261,
    "yao": "阳",
    "yaoi": "九四",
    "text": "包无鱼，起凶。"
  },
  {
    "rank": 262,
    "yao": "阳",
    "yaoi": "九三",
    "text": "臀无肤，其行次且，厉，无大咎。"
  },
  {
    "rank": 263,
    "yao": "阳",
    "yaoi": "九二",
    "text": "包有鱼，无咎，不利宾。"
  },
  {
    "rank": 264,
    "yao": "阴",
    "yaoi": "初六",
    "text": "系于金柅，贞吉，有攸往，见凶，羸豕踟躅。"
  },
  {
    "rank": 265,
    "yao": "阴",
    "yaoi": "上六",
    "text": "齎谘涕洟，无咎。"
  },
  {
    "rank": 266,
    "yao": "阳",
    "yaoi": "九五",
    "text": "萃有位，无咎。匪孚，元永贞，悔亡。"
  },
  {
    "rank": 267,
    "yao": "阳",
    "yaoi": "九四",
    "text": "大吉，无咎。"
  },
  {
    "rank": 268,
    "yao": "阴",
    "yaoi": "六三",
    "text": "萃如，嗟如，无攸利，往无咎，小吝。"
  },
  {
    "rank": 269,
    "yao": "阴",
    "yaoi": "六二",
    "text": "引吉，无咎，孚乃利用禴。"
  },
  {
    "rank": 270,
    "yao": "阴",
    "yaoi": "初六",
    "text": "有孚不终，乃乱乃萃，若号一握为笑，勿恤，往无咎。"
  },
  {
    "rank": 271,
    "yao": "阴",
    "yaoi": "上六",
    "text": "冥升，利于不息之贞。"
  },
  {
    "rank": 272,
    "yao": "阴",
    "yaoi": "六五",
    "text": "贞吉，升阶。"
  },
  {
    "rank": 273,
    "yao": "阴",
    "yaoi": "六四",
    "text": "王用亨于岐山，吉无咎。"
  },
  {
    "rank": 274,
    "yao": "阳",
    "yaoi": "九三",
    "text": "升虚邑。"
  },
  {
    "rank": 275,
    "yao": "阳",
    "yaoi": "九二",
    "text": "孚乃利用禴，无咎。"
  },
  {
    "rank": 276,
    "yao": "阴",
    "yaoi": "初六",
    "text": "允升，大吉。"
  },
  {
    "rank": 277,
    "yao": "阴",
    "yaoi": "上六",
    "text": "困于葛藟，于臲卼，曰动悔。有悔，征吉。"
  },
  {
    "rank": 278,
    "yao": "阳",
    "yaoi": "九五",
    "text": "劓刖，困于赤绂，乃徐有说，利用祭祀。"
  },
  {
    "rank": 279,
    "yao": "阳",
    "yaoi": "九四",
    "text": "来徐徐，困于金车，吝，有终。"
  },
  {
    "rank": 280,
    "yao": "阴",
    "yaoi": "六三",
    "text": "困于石，据于蒺藜，入于其宫，不见其妻，凶。"
  },
  {
    "rank": 281,
    "yao": "阳",
    "yaoi": "九二",
    "text": "困于酒食，朱绂方来，利用亨祀，征凶，无咎。"
  },
  {
    "rank": 282,
    "yao": "阴",
    "yaoi": "初六",
    "text": "臀困于株木，入于幽谷，三岁不觌。"
  },
  {
    "rank": 283,
    "yao": "阴",
    "yaoi": "上六",
    "text": "井收勿幕，有孚无吉。"
  },
  {
    "rank": 284,
    "yao": "阳",
    "yaoi": "九五",
    "text": "井冽，寒泉食。"
  },
  {
    "rank": 285,
    "yao": "阴",
    "yaoi": "六四",
    "text": "井甃，无咎。"
  },
  {
    "rank": 286,
    "yao": "阳",
    "yaoi": "九三",
    "text": "井渫不食，为我民恻，可用汲，王明，并受 其福。"
  },
  {
    "rank": 287,
    "yao": "阳",
    "yaoi": "九二",
    "text": "井穀射鲋，瓮敝漏。"
  },
  {
    "rank": 288,
    "yao": "阴",
    "yaoi": "初六",
    "text": "井泥不食，旧井无禽。"
  },
  {
    "rank": 289,
    "yao": "阴",
    "yaoi": "上六",
    "text": "君子豹变，小人革面，征凶，居贞吉。"
  },
  {
    "rank": 290,
    "yao": "阳",
    "yaoi": "九五",
    "text": "大人虎变，未佔有孚。"
  },
  {
    "rank": 291,
    "yao": "阳",
    "yaoi": "九四",
    "text": "悔亡，有孚改命，吉。"
  },
  {
    "rank": 292,
    "yao": "阳",
    "yaoi": "九三",
    "text": "征凶，贞厉，革言三就，有孚。"
  },
  {
    "rank": 293,
    "yao": "阴",
    "yaoi": "六二",
    "text": "己日乃革之，征吉，无咎。"
  },
  {
    "rank": 294,
    "yao": "阳",
    "yaoi": "初九",
    "text": "巩用黄牛之革。"
  },
  {
    "rank": 295,
    "yao": "阳",
    "yaoi": "上九",
    "text": "鼎玉铉，大吉，无不利。"
  },
  {
    "rank": 296,
    "yao": "阴",
    "yaoi": "六五",
    "text": "鼎黄耳金铉，利贞。"
  },
  {
    "rank": 297,
    "yao": "阳",
    "yaoi": "九四",
    "text": "鼎折足，覆公餗，其形渥，凶。"
  },
  {
    "rank": 298,
    "yao": "阳",
    "yaoi": "九三",
    "text": "鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。"
  },
  {
    "rank": 299,
    "yao": "阳",
    "yaoi": "九二",
    "text": "鼎有实，我仇有疾，不我能即，吉。"
  },
  {
    "rank": 300,
    "yao": "阴",
    "yaoi": "初六",
    "text": "鼎颠趾，利出否，得妾以其子，无咎。"
  },
  {
    "rank": 301,
    "yao": "阴",
    "yaoi": "上六",
    "text": "震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。"
  },
  {
    "rank": 302,
    "yao": "阴",
    "yaoi": "六五",
    "text": "震往来厉，亿无丧，有事。"
  },
  {
    "rank": 303,
    "yao": "阳",
    "yaoi": "九四",
    "text": "震遂泥。"
  },
  {
    "rank": 304,
    "yao": "阴",
    "yaoi": "六三",
    "text": "震苏苏，震行无眚。"
  },
  {
    "rank": 305,
    "yao": "阴",
    "yaoi": "六二",
    "text": "震来厉，亿丧贝，跻于九陵，勿逐，七日得。"
  },
  {
    "rank": 306,
    "yao": "阳",
    "yaoi": "初九",
    "text": "震来虩虩，后笑言哑哑，吉。"
  },
  {
    "rank": 307,
    "yao": "阳",
    "yaoi": "上九",
    "text": "敦艮，吉。"
  },
  {
    "rank": 308,
    "yao": "阴",
    "yaoi": "六五",
    "text": "艮其辅，言有序，悔亡。"
  },
  {
    "rank": 309,
    "yao": "阴",
    "yaoi": "六四",
    "text": "艮其身，无咎。"
  },
  {
    "rank": 310,
    "yao": "阳",
    "yaoi": "九三",
    "text": "艮其限，列其夤，厉薰心。"
  },
  {
    "rank": 311,
    "yao": "阴",
    "yaoi": "六二",
    "text": "艮其腓，不拯其随，其心不快。"
  },
  {
    "rank": 312,
    "yao": "阴",
    "yaoi": "初六",
    "text": "艮其趾，无咎，利永贞。"
  },
  {
    "rank": 313,
    "yao": "阳",
    "yaoi": "上九",
    "text": "鸿渐于逵，其羽可用为仪，吉。"
  },
  {
    "rank": 314,
    "yao": "阳",
    "yaoi": "九五",
    "text": "鸿渐于陵，妇三岁不孕，终莫之胜，吉。"
  },
  {
    "rank": 315,
    "yao": "阴",
    "yaoi": "六四",
    "text": "鸿渐于木，或得其桷，无咎。"
  },
  {
    "rank": 316,
    "yao": "阳",
    "yaoi": "九三",
    "text": "鸿渐于陆，夫征不复，妇孕不育，凶，利御寇。"
  },
  {
    "rank": 317,
    "yao": "阴",
    "yaoi": "六二",
    "text": "鸿渐于磐，饮食衎衎，吉。"
  },
  {
    "rank": 318,
    "yao": "阴",
    "yaoi": "初六",
    "text": "鸿渐于干，小子厉，有言，无咎。"
  },
  {
    "rank": 319,
    "yao": "阴",
    "yaoi": "上六",
    "text": "女承筐无实，士刲羊无血，无攸利。"
  },
  {
    "rank": 320,
    "yao": "阴",
    "yaoi": "六五",
    "text": "帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。"
  },
  {
    "rank": 321,
    "yao": "阳",
    "yaoi": "九四",
    "text": "归妹愆期，迟归有时。"
  },
  {
    "rank": 322,
    "yao": "阴",
    "yaoi": "六三",
    "text": "归妹以须，反归以娣。"
  },
  {
    "rank": 323,
    "yao": "阳",
    "yaoi": "九二",
    "text": "眇能视，利幽人之贞。"
  },
  {
    "rank": 324,
    "yao": "阳",
    "yaoi": "初九",
    "text": "归妹以娣，跛能履，征吉。"
  },
  {
    "rank": 325,
    "yao": "阴",
    "yaoi": "上六",
    "text": "丰其屋，蔀其家，闚其户，阒其无人， 三岁不觌，凶。"
  },
  {
    "rank": 326,
    "yao": "阴",
    "yaoi": "六五",
    "text": "来章，有庆誉，吉。"
  },
  {
    "rank": 327,
    "yao": "阳",
    "yaoi": "九四",
    "text": "丰其蔀，日中见斗，遇其夷主，吉。"
  },
  {
    "rank": 328,
    "yao": "阳",
    "yaoi": "九三",
    "text": "丰其沛，日中见昧，折其右肱，无咎。"
  },
  {
    "rank": 329,
    "yao": "阴",
    "yaoi": "六二",
    "text": "丰其蔀，日中见斗，往得疑疾，有孚发若，吉。"
  },
  {
    "rank": 330,
    "yao": "阳",
    "yaoi": "初九",
    "text": "遇其配主，虽旬无咎，往有尚。"
  },
  {
    "rank": 331,
    "yao": "阳",
    "yaoi": "上九",
    "text": "鸟焚其巢，旅人先笑后号啕。丧牛于易，凶。"
  },
  {
    "rank": 332,
    "yao": "阴",
    "yaoi": "六五",
    "text": "射雉一矢亡，终以誉命。"
  },
  {
    "rank": 333,
    "yao": "阳",
    "yaoi": "九四",
    "text": "旅于处，得其资斧，我心不快。"
  },
  {
    "rank": 334,
    "yao": "阳",
    "yaoi": "九三",
    "text": "旅焚其次，丧其童僕，贞厉。"
  },
  {
    "rank": 335,
    "yao": "阴",
    "yaoi": "六二",
    "text": "旅即次，怀其资，得童僕贞。"
  },
  {
    "rank": 336,
    "yao": "阴",
    "yaoi": "初六",
    "text": "旅琐琐，斯其所取灾。"
  },
  {
    "rank": 337,
    "yao": "阳",
    "yaoi": "上九",
    "text": "巽在床下，丧其资斧，贞凶。"
  },
  {
    "rank": 338,
    "yao": "阳",
    "yaoi": "九五",
    "text": "贞吉悔亡，无不利。无初有终，先庚三日，后庚三日，吉。"
  },
  {
    "rank": 339,
    "yao": "阴",
    "yaoi": "六四",
    "text": "悔亡，田获三品。"
  },
  {
    "rank": 340,
    "yao": "阳",
    "yaoi": "九三",
    "text": "频巽，吝。"
  },
  {
    "rank": 341,
    "yao": "阳",
    "yaoi": "九二",
    "text": "巽在床下，用史巫纷若，吉无咎。"
  },
  {
    "rank": 342,
    "yao": "阴",
    "yaoi": "初六",
    "text": "进退，利武人之贞。"
  },
  {
    "rank": 343,
    "yao": "阴",
    "yaoi": "上六",
    "text": "引兑。"
  },
  {
    "rank": 344,
    "yao": "阳",
    "yaoi": "九五",
    "text": "孚于剥，有厉。"
  },
  {
    "rank": 345,
    "yao": "阳",
    "yaoi": "九四",
    "text": "商兑，未宁，介疾有喜。"
  },
  {
    "rank": 346,
    "yao": "阴",
    "yaoi": "六三",
    "text": "来兑，凶。"
  },
  {
    "rank": 347,
    "yao": "阳",
    "yaoi": "九二",
    "text": "孚兑，吉，悔亡。"
  },
  {
    "rank": 348,
    "yao": "阳",
    "yaoi": "初九",
    "text": "和兑，吉。"
  },
  {
    "rank": 349,
    "yao": "阳",
    "yaoi": "上九",
    "text": "涣其血，去逖出，无咎。"
  },
  {
    "rank": 350,
    "yao": "阳",
    "yaoi": "九五",
    "text": "涣汗其大号，涣王居，无咎。"
  },
  {
    "rank": 351,
    "yao": "阴",
    "yaoi": "六四",
    "text": "涣其群，元吉。涣有丘，匪夷所思。"
  },
  {
    "rank": 352,
    "yao": "阴",
    "yaoi": "六三",
    "text": "涣其躬，无悔。"
  },
  {
    "rank": 353,
    "yao": "阳",
    "yaoi": "九二",
    "text": "涣奔其机，悔亡。"
  },
  {
    "rank": 354,
    "yao": "阴",
    "yaoi": "初六",
    "text": "用拯马壮，吉。"
  },
  {
    "rank": 355,
    "yao": "阴",
    "yaoi": "上六",
    "text": "苦节，贞凶，悔亡。"
  },
  {
    "rank": 356,
    "yao": "阳",
    "yaoi": "九五",
    "text": "甘节，吉，往有尚。"
  },
  {
    "rank": 357,
    "yao": "阴",
    "yaoi": "六四",
    "text": "安节，亨。"
  },
  {
    "rank": 358,
    "yao": "阴",
    "yaoi": "六三",
    "text": "不节若，则嗟若，无咎。"
  },
  {
    "rank": 359,
    "yao": "阳",
    "yaoi": "九二",
    "text": "不出门庭，凶。"
  },
  {
    "rank": 360,
    "yao": "阳",
    "yaoi": "初九",
    "text": "不出户庭，无咎。"
  },
  {
    "rank": 361,
    "yao": "阳",
    "yaoi": "上九",
    "text": "翰音登于天，贞凶。"
  },
  {
    "rank": 362,
    "yao": "阳",
    "yaoi": "九五",
    "text": "有孚挛如，无咎。"
  },
  {
    "rank": 363,
    "yao": "阴",
    "yaoi": "六四",
    "text": "月几望，马匹亡，无咎。"
  },
  {
    "rank": 364,
    "yao": "阴",
    "yaoi": "六三",
    "text": "得敌，或鼓或罢，或泣或歌。"
  },
  {
    "rank": 365,
    "yao": "阳",
    "yaoi": "九二",
    "text": "鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。"
  },
  {
    "rank": 366,
    "yao": "阳",
    "yaoi": "初九",
    "text": "虞吉，有他不燕。"
  },
  {
    "rank": 367,
    "yao": "阴",
    "yaoi": "上六",
    "text": "弗遇过之，飞鸟离之，凶，是谓灾眚。"
  },
  {
    "rank": 368,
    "yao": "阴",
    "yaoi": "六五",
    "text": "密云不雨，自我西郊，公弋取彼在穴。"
  },
  {
    "rank": 369,
    "yao": "阳",
    "yaoi": "九四",
    "text": "无咎，弗过遇之。往厉必戒，勿用永贞。"
  },
  {
    "rank": 370,
    "yao": "阳",
    "yaoi": "九三",
    "text": "弗过防之，从或戕之，凶。"
  },
  {
    "rank": 371,
    "yao": "阴",
    "yaoi": "六二",
    "text": "过其祖，遇其妣，不及其君，遇其臣，无咎。"
  },
  {
    "rank": 372,
    "yao": "阴",
    "yaoi": "初六",
    "text": "飞鸟以凶。"
  },
  {
    "rank": 373,
    "yao": "阴",
    "yaoi": "上六",
    "text": "濡其首，厉。"
  },
  {
    "rank": 374,
    "yao": "阳",
    "yaoi": "九五",
    "text": "东邻杀牛，不如西邻之禴祭，实受其福。"
  },
  {
    "rank": 375,
    "yao": "阴",
    "yaoi": "六四",
    "text": "繻有衣袽，终日戒。"
  },
  {
    "rank": 376,
    "yao": "阳",
    "yaoi": "九三",
    "text": "高宗伐鬼方，三年克之，小人勿用。"
  },
  {
    "rank": 377,
    "yao": "阴",
    "yaoi": "六二",
    "text": "妇丧其髴，勿逐，七日得。"
  },
  {
    "rank": 378,
    "yao": "阳",
    "yaoi": "初九",
    "text": "曳其轮，濡其尾，无咎。"
  },
  {
    "rank": 379,
    "yao": "阳",
    "yaoi": "上九",
    "text": "有孚于饮酒，无咎，濡其首，有孚失是。"
  },
  {
    "rank": 380,
    "yao": "阴",
    "yaoi": "六五",
    "text": "贞吉，无悔，君子之光，有孚，吉。"
  },
  {
    "rank": 381,
    "yao": "阳",
    "yaoi": "九四",
    "text": "贞吉，悔亡，震用伐鬼方，三年有赏于大国。"
  },
  {
    "rank": 382,
    "yao": "阴",
    "yaoi": "六三",
    "text": "未济，征凶，利涉大川。"
  },
  {
    "rank": 383,
    "yao": "阳",
    "yaoi": "九二",
    "text": "曳其轮，贞吉。"
  },
  {
    "rank": 384,
    "yao": "阴",
    "yaoi": "初六",
    "text": "濡其尾，吝。"
  }
]

module.exports = {
  yaos: yaos
}